cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1.svd
                <register>
                    <name>SSISCR</name>
                    <description>Status Control Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDES</name>
                            <description>TDE Setting Condition Select</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>SSIFTDR has one stage or more free space</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>SSIFTDR has two stages or more free space (snip)</description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11110</name>
                                    <description>SSIFTDR has thirty-one stages or more free space</description>
                                    <value>#11110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111</name>
                                    <description>SSIFTDR has thirty-two stages or more free space.</description>
                                    <value>#11111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RDFS</name>
                            <description>RDF Setting Condition Select</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>SSIFRDR has one stage or more data size</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>SSIFRDR has two stages or more data size (snip)</description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11110</name>
                                    <description>SSIFRDR has thirty-one stages or more data size</description>
                                    <value>#11110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111</name>
                                    <description>SSIFRDR has thirty-two stages or more data size.</description>
                                    <value>#11111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ELC</name>
            <description>Event Link Controller </description>
            <baseAddress>0x40041000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>76</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ELCR</name>
                    <description>Event Link Controller Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ELCON</name>
                            <description>All Event Link Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable ELC function</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable ELC function.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0,1</dimIndex>
                    <name>ELSEGR%s</name>
                    <description>Event Link Software Event Generation Register %s</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WI</name>
                            <description>ELSEGR Register Write Disable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable writes to ELSEGR register</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disable writes to ELSEGR register.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WE</name>
                            <description>SEG Bit Write Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable writes to SEG bit</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable writes to SEG bit</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEG</name>
                            <description>Software Event Generation</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Generate a software event</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>19</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-18</dimIndex>
                    <name>ELSR%s</name>
                    <description>Event Link Setting Register %s</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ELS</name>
                            <description>Event Link Select</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x000</name>
                                    <description>Event output to the corresponding peripheral module is disabled.</description>
                                    <value>0x000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Set the number for the event signal to be linked.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
