cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CAN0</name>
            <description>CAN0 Module   </description>
            <baseAddress>0x40050000</baseAddress>
            <addressBlock>
                <offset>0x200</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x204</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x206</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x207</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x208</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x209</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20A</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20B</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20C</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20D</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20E</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x400</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x42C</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x820</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x820</offset>
                <size>57</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_ID</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>IDE</name>
                            <description>ID Extension</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Standard ID</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extended ID</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>Remote Transmission Request</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>Standard ID </description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EID</name>
                            <description>Extended ID</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_DL</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x204</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>DLC</name>
                            <description>Data Length Code</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>Data length = 0 byte</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>Data length = 1 byte</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>Data length = 2 bytes</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>Data length = 3 bytes</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>Data length = 4 bytes</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>Data length = 5 bytes</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>Data length = 6 bytes</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111</name>
                                    <description>Data length = 7 bytes</description>
                                    <value>#0111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Data length = 8 bytes</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D0</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x206</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA0</name>
                            <description>Data Bytes 0.DATA0  store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D1</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x207</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>Data Bytes 1DATA1  store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D2</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x208</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA2</name>
                            <description>Data Bytes 2DATA2  store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D3</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x209</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>Data Bytes 3DATA3  store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D4</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x20A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA4</name>
                            <description>Data Bytes 4DATA4 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D5</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x20B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA5</name>
                            <description>Data Bytes 5DATA5 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D6</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x20C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA6</name>
                            <description>Data Bytes 6DATA6 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D7</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x20D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>Data Bytes 7DATA7 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_TS</name>
                    <description>Mailbox Register </description>
                    <addressOffset>0x20E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>TSH</name>
                            <description>Time Stamp Lower ByteBits TSH[7:0] store the counter value of the time stamp when received messages are stored in the mailbox.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSL</name>
                            <description>Time Stamp Higher ByteBits TSL[7:0] store the counter value of the time stamp when received messages are stored in the mailbox.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MKR[%s]</name>
                    <description>Mask Register </description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>SID</name>
                            <description>Standard ID </description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EID</name>
                            <description>Extended ID</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
