cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC1</name>
            <description>Direct memory access controller 1</description>
            <baseAddress>0x40005040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC2</name>
            <description>Direct memory access controller 2</description>
            <baseAddress>0x40005080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC3</name>
            <description>Direct memory access controller 3</description>
            <baseAddress>0x400050C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC4</name>
            <description>Direct memory access controller 4</description>
            <baseAddress>0x40005100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC5</name>
            <description>Direct memory access controller 5</description>
            <baseAddress>0x40005140</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC6</name>
            <description>Direct memory access controller 6</description>
            <baseAddress>0x40005180</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC7</name>
            <description>Direct memory access controller 7</description>
            <baseAddress>0x400051C0</baseAddress>
        </peripheral>
        <peripheral>
            <name>DMA</name>
            <description>DMAC Module Activation</description>
            <baseAddress>0x40005200</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DMAST</name>
                    <description>DMA  Module Activation Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DMST</name>
                            <description>DMAC Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DMAC activation is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DMAC activation is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>DTC</name>
            <description>Data Transfer Controller</description>
            <baseAddress>0x40005400</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0E</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DTCCR</name>
                    <description>DTC Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x08</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RRS</name>
                            <description>DTC Transfer Information Read Skip Enable.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not skip transfer information read</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Skip transfer information read when vector numbers match</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTCVBR</name>
                    <description>DTC Vector Base Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DTCVBR</name>
                            <description>DTC Vector Base Address.Note: A value cannot be set in the lower-order 10 bits. These bits are fixed to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTCST</name>
                    <description>DTC Module Start Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DTCST</name>
                            <description>DTC Module Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DTC module stop</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DTC module start</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTCSTS</name>
                    <description>DTC Status Register</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ACT</name>
                            <description>DTC Active Flag</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DTC transfer operation is not in progress.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DTC transfer operation is in progress.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VECN</name>
                            <description>DTC-Activating Vector Number MonitoringThese bits indicate the vector number for the activating source when DTC transfer is in progress.The value is only valid if DTC transfer is in progress (the value of the ACT flag is 1)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
