cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1.svd
                <register>
                    <name>RSTSR1</name>
                    <description>Reset Status Register 1</description>
                    <addressOffset>0x0C0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xE0F8</resetMask>
                    <fields>
                        <field>
                            <name>SPERF</name>
                            <description>SP Error Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>SP error reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>SP error reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSMRF</name>
                            <description>Bus Master MPU Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus Master MPU reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus Master MPU reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSSRF</name>
                            <description>Bus Slave MPU Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus Slave MPU reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus Slave MPU reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>REERF</name>
                            <description>RAM ECC Error Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RAM ECC error reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RAM ECC error reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RPERF</name>
                            <description>RAM Parity Error Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RAM parity error reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RAM parity error reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SWRF</name>
                            <description>Software Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WDTRF</name>
                            <description>Watchdog Timer Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Watchdog timer reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Watchdog timer reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IWDTRF</name>
                            <description>Independent Watchdog Timer Reset Detect FlagNOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Independent watchdog timer reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Independent watchdog timer reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
