cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1.svd
                <register>
                    <name>RYRAR</name>
                    <description>Year Alarm Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>YR10</name>
                            <description>10 Years Value for the tens place of years</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>YR1</name>
                            <description>1 Year Value for the ones place of years</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT2AER</name>
                    <description>Binary Counter 2 Alarm Enable Register</description>
                    <alternateRegister>RYRAR</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>The BCNT2AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b23 to b16.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RYRAREN</name>
                    <description>Year Alarm Enable Register</description>
                    <addressOffset>0x1E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The register value is not compared with the RYRCNT counter value.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The register value is compared with the RYRCNT counter value.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT3AER</name>
                    <description>Binary Counter 3 Alarm Enable Register</description>
                    <alternateRegister>RYRAREN</alternateRegister>
                    <addressOffset>0x1E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>The BCNT3AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b31 to b24. </description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCR1</name>
                    <description>RTC Control Register 1</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0A</resetMask>
                    <fields>
                        <field>
                            <name>PES</name>
                            <description>Periodic Interrupt Select</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>A periodic interrupt is generated every 1/256 second((RCR4.RCKSEL = 0)./A periodic interrupt is generated every 1/128 second((RCR4.RCKSEL = 1).</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111</name>
                                    <description>A periodic interrupt is generated every 1/128 second.</description>
                                    <value>#0111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>A periodic interrupt is generated every 1/64 second.</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>A periodic interrupt is generated every 1/32 second.</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>A periodic interrupt is generated every 1/16 second.</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1011</name>
                                    <description>A periodic interrupt is generated every 1/8 second.</description>
                                    <value>#1011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1100</name>
                                    <description>A periodic interrupt is generated every 1/4 second.</description>
                                    <value>#1100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1101</name>
                                    <description>A periodic interrupt is generated every 1/2 second.</description>
                                    <value>#1101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1110</name>
                                    <description>A periodic interrupt is generated every 1 second.</description>
                                    <value>#1110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111</name>
                                    <description>A periodic interrupt is generated every 2 seconds.</description>
                                    <value>#1111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>No periodic interrupts are generated.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCOS</name>
                            <description>RTCOUT Output Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RTCOUT outputs 1 Hz.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RTCOUT outputs 64 Hz.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIE</name>
                            <description>Periodic Interrupt Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A periodic interrupt request is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A periodic interrupt request is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CIE</name>
                            <description>Carry Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A carry interrupt request is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A carry interrupt request is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AIE</name>
                            <description>Alarm Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>An alarm interrupt request is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An alarm interrupt request is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCR2</name>
                    <description>RTC Control Register 2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0E</resetMask>
                    <fields>
                        <field>
                            <name>CNTMD</name>
                            <description>Count Mode Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The calendar count mode.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The binary count mode.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>HR24</name>
                            <description>Hours Mode</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The RTC operates in 12-hour mode.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The RTC operates in 24-hour mode.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AADJP</name>
                            <description>Automatic Adjustment Period Select (When the LOCO clock is selected, the setting of this bit is disabled.)</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The RADJ.ADJ[5:0] setting value is adjusted from the count value of the prescaler every minute.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The RADJ.ADJ[5:0] setting value is adjusted from the count value of the prescaler every 10 seconds.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AADJE</name>
                            <description>Automatic Adjustment Enable (When the LOCO clock is selected, the setting of this bit is disabled.)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Automatic adjustment is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Automatic adjustment is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCOE</name>
                            <description>RTCOUT Output Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RTCOUT output disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RTCOUT output enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADJ30</name>
                            <description>30-Second Adjustment</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Writing is invalid.(write) / In normal time operation, or 30-second adjustment has completed.(read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>30-second adjustment is executed.(write) / During 30-second adjustment.(read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESET</name>
                            <description>RTC Software Reset</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Writing is invalid.(write) /  In normal time operation, or an RTC software reset has completed.(read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The prescaler and the target registers for RTC software reset *1 are initialized.(write) / During an RTC software reset.(read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>START</name>
                            <description>Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Prescaler and time counter are stopped.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Prescaler and time counter operate normally.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
